// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的長度可以任意， 你可以寫十句話， 二十句話都可以
    // 每句話盡量不要超過15個字,不然展示效果可能不太好
    texts: [
        "送給我",      //這裡,每句話結尾的最後一個逗號必須是英文的哦!! 很重要哦!!
        "心愛的🐷🐷",  // 同上...
        "今天是你的生日",
        "這是我們在一起的",
        "第一個生日",
        "希望未來的每一年",
        "都一起過",
        "今年要吃好吃的",
        "明年也要吃好吃的",
        "只要有你在什麼都好吃",
        "然後當一個健康快樂的",
        "我的堡堡🍔",
        "因為你快樂",
        "我才會快樂",
        "Love U~~❤️🥰",
    ],
    /**
     * imgs 可以不填, 但是如果要填寫的話必須遵循下面的格式
     * "對應上面的文字, 要完全一樣" : "圖片地址, 可以把圖片放在imgs資料夾中"
     * 例如
     * "心愛的小可愛": "./imgs/xiaokeai.jpg"
     *
     * 如果不要圖片的話, 直接在每行開頭寫兩個斜槓註釋即可, 例如下面的 "今天是你的生日" 的圖片就不會展示了:)
     * Tip: 圖片最好用正方形or接近正方形, 看起來效果更好
     */
    imgs: {
        "心愛的🐷🐷": "./imgs/MEITU_20250502_000352581.jpg",
        "今天是你的生日": "./imgs/1.jpg",
        "這是我們在一起的": "./imgs/IMG-20250324-WA0001.jpg",
        "第一個生日": "./imgs/20250501_135705.jpg",
        "都一起過": "./imgs/20250625_233038.jpg",
        "只要有你在什麼都好吃": "./imgs/20250406_220934.jpg",
        "然後當一個健康快樂的": "./imgs/20250629_221749.jpg",
        "我的堡堡🍔": "./imgs/DSCF1225-1.jpg",
        "Love U~~❤️🥰": "./imgs/1736785505717.jpg",
        // "第一個生日": "./imgs/1.jpg",
        // "希望未來的每一年": "./imgs/1.jpg",
        // "都一起過": "./imgs/1.jpg",
        // "今年要吃好吃的": "./imgs/1.jpg",
        // "明年也要吃好吃的": "./imgs/1.jpg",
        // "只要有你在什麼都好吃": "./imgs/1.jpg",
        // "然後當一個健康快樂的": "./imgs/1.jpg",
        // "我的堡堡🍔": "./imgs/1.jpg",
        // "因為你快樂": "./imgs/1.jpg",
        // "我才會快樂": "./imgs/1.jpg",
        // "Love": "./imgs/1.jpg",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按鈕文字描述, 以下是預設的按鈕文字，英文的，您可以改成你喜歡的文字
    desc: {
        turn_on: "🐈",
        play: "🎵",
        bannar_coming: "🐱",
        balloons_flying: "蛋糕在哪裡!!",
        cake_fadein: "🎂🎂🍰",
        light_candle: "🕯️x26",
        wish_message: "馬佩如生日快樂",
        story: "有些話跟你說",
    }
};